#include <stdio.h>

int main() {
    int i=1; // ประกาศตัวแปร i เป็นจำนวนเต็ม

        do { // ใช้ do while loop
            printf("%d ", i); // แสดงค่าของ i
            i++; 
            if (i == 6) { // ถ้า i มีค่าเท่ากับ 6 ให้ข้ามการทำงานในรอบนั้นไป
                i++;
                continue; // คำสั่ง continue จะทำให้โปรแกรมข้ามการทำงานที่เหลือในรอบนั้นไป และเริ่มรอบใหม่ทันที
            }
        } while (i <= 10); // ระบุให้ while ทำงานจนกว่า i จะมีค่ามากกว่า 10

return 0; // ส่งค่ากลับ 0 เพื่อบอกว่าโปรแกรมทำงานเสร็จสมบูรณ์
}
/* กรณี for จะเป็นการระบุค่าตัวแปร;ค่าเงื่อนไขเเละ;ค่า update อยู่เลยในบรรทัดเดียว จากนั้นจะเป็นการเช็ค ตามเงื่อนไข if ว่าถ้า i เท่ากับ 6 หรือไม่ 
และ จะบวกค่า i+1 จะข้าม continue ไป loop รอบถัดไปเพื่อไม่ให้แสดงค่า 6 ออกมา จนกว่า i จะมีค่ามากกว่า 10 จึงจะออกจาก loop

กรณีการใช้ while จะเป็นการระบุเงื่อนไขเเละตัวแปรแยกกันเเละจากนั้นจะเข้า loop เเละเข้าตามเงื่อนไข if เมื่อ i=6 จะทำการบวกค่า i+1 เเละ continue เพื่อข้ามการเเสดงผลค่า 6 ออกไป
เเต่โดยรวมจะเป็นการทำงานคล้ายกับ for loop เเต่จะยืดหยุ่นมากกว่าในกรณีที่ไม่รู้ค่าเริ่มตั้นเเละสิ้นสุดที่แน่นอน

กรณีการใช้ do while จะเป็นการทำตามเงื่อนไขก่อน 1 ครั้ง จากนั้นจึงค่อยเช็คว่าตามเงื่อนไขรึป่าว โดยเมื่อ i เท่ากับ 6 จะเป็นการเข้าตามเงื่อนไข if เเละ
จะบวกค่า i ทำให้ i ทำกับ 7 เเละ continue skip การเเสดงค่า 6 เพื่อไป loop รอบถัดไป จนกว่า i จะมีค่ามากกว่า 10 จึงจะออกจาก loop

สรุปผล ทั้ง 3 แบบสามารถทำให้แสดงผลได้เหมือนกับเเต่จะเขียนในเเบบที่เเตกต่างกัน ซึงทั้งสามเเบบจะมีคุณสมบัติหรือข้อเด่นที่เเตกต่างกันตามข้อความข้างต้น
ขึ้นอยู่กับการใช้งาน*/