 #include <stdio.h> // นำเข้าไลบรารีมาตรฐานสำหรับการใช้งานฟังก์ชันการป้อนข้อมูลและแสดงผล

int main() { // ฟังก์ชันหลักของโปรแกรม
    int sum, p, x, y; // ประกาศตัวแปร sum, p, x, y เป็นจำนวนเต็ม
    sum = 0;

    for (x = 1, y = 1; x * y <= 15; x++, y += 2) // ใช้ลูป for เพื่อทำซ้ำโดยที่ x เริ่มต้นที่ 1 และ y เริ่มต้นที่ 1 โดยเงื่อนไขคือ x * y ต้องไม่เกิน 15 ในแต่ละรอบ x จะเพิ่มขึ้นทีละ 1 และ y จะเพิ่มขึ้นทีละ 2
    {
        p = x * y;// คำนวณผลคูณของ x และ y แล้วเก็บไว้ในตัวแปร p
        sum = sum + p;
        printf("%d * %d = %d\n", x, y, p);// แสดงผลลัพธ์ของการคูณ x และ y พร้อมกับผลลัพธ์ p
    }
    
    printf("ผลรวม ของ x * y = %d\n", sum);// แสดงผลลัพธ์ของผลรวม sum ของผลคูณทั้งหมด
    
    return 0;// ส่งค่ากลับ 0 เพื่อบอกว่าโปรแกรมทำงานเสร็จสมบูรณ์
}

/* จาก code ที่ได้เป็นการหาค่าผลรวมหรือ summation ของ x*y โดย ตอนเริ่มต้นมีค่าต่าง ๆ คือ x=1 y=1 sum=0
รอบที่ 1 : x=1 y=1 p=1*1=1 sum=0+1=1(โดย sum คือการเก็บค่าผลรวมของ p ไปเรื่อยๆ จนจบ loop โดยที่ p คือ ผลคูณของ x และ y) จึงแสดงข้อความ 1 * 1 = 1
รอบที่ 2 : x=2 y=3 p=2*3=6 sum=1+6=7 จึงแสดงข้อความ 2 * 3 = 6
รอบที่ 3 : x=3 y=5 p=3*5=15 sum=7+15=22 จึงแสดงข้อความ 3 * 5 = 15
ในรอบสุดท้าย x*y จะเท่ากับ 4*7=28 ทำให้มีค่ามากกว่า 15 เลยไม่อยู่ในเงื่อนไขของ for เลยออกจาก loop
จากกนั้นจึงแสดงข้อความ summation of x * y = 22 

สรุป โปรแกรมนี้เป็นการหาค่า summation ของ ตัวแปร x กับ y โดยที่แทนค่า p เป็นผลคูณของ x กับ y
และ sum เป็นผลบวกของ p *ที่ได้ในแต่ละรอบ จนกว่า x*y จะมีค่ามากกว่า 15 */