#include <stdio.h>

int main() { // ฟังก์ชันหลักของโปรแกรม
    int i=1; // ประกาศตัวแปร i เป็นจำนวนเต็ม
    while (i <= 10) { // ระบุให้ while ทำงานจนกว่า i จะมีค่ามากกว่า 10
        if (i == 6) { // ถ้า i มีค่าเท่ากับ 6 ให้ข้ามการทำงานในรอบนั้นไป
            i++; 
            continue; // คำสั่ง continue จะทำให้โปรแกรมข้ามการทำงานที่เหลือในรอบนั้นไป และเริ่มรอบใหม่ทันที
        }
        printf("%d ", i); // แสดงค่าของ i
        i++; // ให้บวก i ทีละ 1
    }
    return 0; // ส่งค่ากลับ 0 เพื่อบอกว่าโปรแกรมทำงานเสร็จสมบูรณ์
}